In [16]:
import pandas as pd

In [17]:
df = pd.read_csv('buddymove_holidayiq.csv')

In [18]:
df.shape

(249, 7)

In [19]:
df.head()

  User Id  Sports  Religious  Nature  Theatre  Shopping  Picnic
0  User 1       2         77      79       69        68      95
1  User 2       2         62      76       76        69      68
2  User 3       2         50      97       87        50      75
3  User 4       2         68      77       95        76      61
4  User 5       2         98      54       59        95      86

In [20]:
import sqlite3

In [21]:
conn = sqlite3.connect('buddymove_holidayiq.sqlite3')

In [22]:
conn

In [23]:
df.to_sql('review',con=conn,if_exists='replace')

In [24]:
curs = conn.cursor()

In [25]:
curs.execute("SELECT COUNT(*) FROM review").fetchall()

[(249,)]

In [26]:
curs.execute("SELECT COUNT(CASE WHEN Shopping >= 100 then 1 else null end) FROM review WHERE Nature>=100").fetchall()

[(78,)]

In [27]:
df2 = df[df['Nature']>=100]

In [28]:
df2[df2['Shopping']>=100]

      User Id  Sports  Religious  Nature  Theatre  Shopping  Picnic
52    User 53       4         79     103       68       103      85
54    User 55       8         94     140       89       118      92
61    User 62       8         94     128       89       128      99
63    User 64       6         84     108      138       103      79
65    User 66       6         89     108      128       116      81
..        ...     ...        ...     ...      ...       ...     ...
241  User 242      25        114     238      124       104     178
244  User 245      18        139     148      129       129     168
246  User 247      20        124     178      104       158     174
247  User 248      20        133     149      139       144     213
248  User 249      20        143     149      139       159     143

[78 rows x 7 columns]

In [29]:
curs.close()

In [30]:
conn.commit()